// Plus (+) Operator

// Mathematical Addition
/* 
এখানে দুটি নাম্বার (১ এবং ২) যোগ করা হচ্ছে। 
এটি সাধারণ গাণিতিক যোগফল ৩ রিটার্ন করবে। 
*/
console.log(1 + 2);

// String Concatenation
/* 
এখানে দুটি স্ট্রিং ("Har" এবং "sh") যোগ করা হচ্ছে। 
JavaScript-এ স্ট্রিং এর ক্ষেত্রে '+' অপারেটর কনক্যাটিনেশন বা জোড়া লাগানোর কাজ করে। 
ফলাফল হবে "Harsh"। 
*/
console.log("Har" + "sh");

// Minus (-) Operator
/* 
এটি বিয়োগ করার জন্য ব্যবহৃত হয়। 
৫ থেকে ২ বিয়োগ করলে ফলাফল ৩ পাওয়া যাবে। 
*/
console.log(5 - 2);

// Multiplication (*) Operator
/* 
এটি গুণ করার জন্য ব্যবহৃত হয়। 
৫ এবং ২ গুণ করলে ফলাফল ১০ হবে। 
*/
console.log(5 * 2);

// Divid (/) Operator
/* 
এটি ভাগ করার জন্য ব্যবহৃত হয়। 
১২-কে ৬ দিয়ে ভাগ করলে ভাগফল ২ পাওয়া যাবে। 
*/
console.log(12 / 6);

// Modulus (%) Operator - Returns Remainder
/* 
মডুলাস অপারেটর ভাগশেষ (Remainder) বের করার জন্য ব্যবহৃত হয়। 
১১-কে ৫ দিয়ে ভাগ করলে ৫ দুগুনে ১০ হয় এবং ভাগশেষ ১ থাকে। 
তাই এখানে আউটপুট আসবে ১। 
*/
console.log(11 % 5);

// Exponential (**) Operator
/* 
এটি পাওয়ার বা ঘাত (Power) বের করার জন্য ব্যবহৃত হয়। 
২ ** ৩ মানে হলো ২-এর কিউব (২ গুণ ২ গুণ ২)। 
ফলাফল হবে ৮। 
*/
console.log(2 ** 3);
